OFtutorialTest04_MRF/simpleFoam/turbine_Up/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    INFLOW
    {
        // type            fixedValue;
        // value           uniform (-10 0 0);
		type            zeroGradient;
    }
    OUTFLOW
    {
        // type            inletOutlet;
        // inletValue      uniform (0 0 0);
        // value           uniform (0 0 0);
		// type            zeroGradient;
		type            fixedValue;
		value           uniform (0 0 -100);
		
    }
    
    BLADE
    {
        type            noSlip;
    }

    HUB
    {
        type            noSlip;
    }
    
    SHROUD
    {
        type            noSlip;
    }
    
    PER1
    {
        type            cyclicAMI;
    }
    
    PER2
    {
        type            cyclicAMI;
    }
    

}


// ************************************************************************* //
