OFtutorialTest04_MRF/simpleFoam/turbine_Up/0/Urel
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      Urel;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
50904
(
(0.120401 -0.467339 0)
(0.117758 -0.458655 0)
(0.110419 -0.466073 0)
(0.108249 -0.458198 0)
(0.120669 -0.467342 0)
(0.118017 -0.458642 0)
(0.110641 -0.466079 0)
(0.108465 -0.458191 0)
...
)
;

boundaryField
{
    HUB
    {
        type            noSlip;
    }
    SHROUD
    {
        type            noSlip;
    }
    INFLOW
    {
        type            zeroGradient;
    }
    OUTFLOW
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    BLADE
    {
        type            noSlip;
    }
    PER1
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    PER2
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
